# PLL Constraints
#################
create_clock -period 2.50 my_ddr_pll_CLKOUT0
create_clock -period 15.00 io_systemClk
create_clock -period 10.00 io_memoryClk
create_clock -waveform {3.36 6.73} -period 6.73 video_clk_148_90
create_clock -period 6.73 video_clk_148
create_clock -period 25.0 jtag_inst1_TCK

# False Path
#################
set_clock_groups -exclusive -group {io_systemClk io_memoryClk} -group {video_clk_148}
#set_clock_groups -exclusive -group {io_memoryClk} -group {video_clk_148}
##set_clock_groups -exclusive -group {io_memoryClk} -group {io_systemClk}
#set_clock_groups -exclusive -group {io_systemClk} -group {jtag_inst1_TCK}
#
#set_max_delay 2.000 -from [get_clocks io_memoryClk] -to [get_clocks {io_systemClk}]
#set_max_delay 2.000 -from [get_clocks io_systemClk] -to [get_clocks {io_memoryClk}]
#set_max_delay 6.0 -from [get_clocks io_memoryClk] -to [get_clocks {video_clk_148}]
#set_max_delay 6.0 -from [get_clocks video_clk_148] -to [get_clocks {io_memoryClk}]
#set_max_delay 15.0 -from [get_clocks io_systemClk] -to [get_clocks {jtag_inst1_TCK}]
#set_max_delay 15.0 -from [get_clocks jtag_inst1_TCK] -to [get_clocks {io_systemClk}]
#set_max_delay 6.0 -from [get_clocks io_systemClk] -to [get_clocks {video_clk_148}]

#set_false_path -setup -hold -from io_asyncReset
#set_false_path -setup -hold -from RubySoc_inst/io_memoryReset*
#set_false_path -setup -hold -from RubySoc_inst/io_systemReset*



# GPIO Constraints
####################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_uart_0_io_rxd}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_uart_0_io_rxd}]
set_output_delay -clock io_systemClk -max -4.700 [get_ports {system_spi_0_io_sclk_write}]
set_output_delay -clock io_systemClk -min -2.571 [get_ports {system_spi_0_io_sclk_write}]
set_output_delay -clock io_systemClk -max -4.700 [get_ports {system_spi_0_io_ss}]
set_output_delay -clock io_systemClk -min -2.571 [get_ports {system_spi_0_io_ss}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_uart_0_io_txd}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_uart_0_io_txd}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_i2c_0_io_scl_read}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_i2c_0_io_scl_read}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_i2c_0_io_scl_write}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_i2c_0_io_scl_write}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_i2c_0_io_scl_writeEnable}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_i2c_0_io_scl_writeEnable}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_i2c_0_io_sda_read}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_i2c_0_io_sda_read}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_i2c_0_io_sda_write}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_i2c_0_io_sda_write}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_i2c_0_io_sda_writeEnable}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_i2c_0_io_sda_writeEnable}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_i2c_1_io_scl_read}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_i2c_1_io_scl_read}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_i2c_1_io_scl_write}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_i2c_1_io_scl_write}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_i2c_1_io_scl_writeEnable}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_i2c_1_io_scl_writeEnable}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_i2c_1_io_sda_read}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_i2c_1_io_sda_read}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_i2c_1_io_sda_write}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_i2c_1_io_sda_write}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_i2c_1_io_sda_writeEnable}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_i2c_1_io_sda_writeEnable}]
set_input_delay -clock io_systemClk -max 6.168 [get_ports {system_spi_0_io_data_0_read}]
set_input_delay -clock io_systemClk -min 3.084 [get_ports {system_spi_0_io_data_0_read}]
set_output_delay -clock io_systemClk -max -4.700 [get_ports {system_spi_0_io_data_0_write}]
set_output_delay -clock io_systemClk -min -2.571 [get_ports {system_spi_0_io_data_0_write}]
set_output_delay -clock io_systemClk -max -4.707 [get_ports {system_spi_0_io_data_0_writeEnable}]
set_output_delay -clock io_systemClk -min -2.567 [get_ports {system_spi_0_io_data_0_writeEnable}]
set_input_delay -clock io_systemClk -max 6.168 [get_ports {system_spi_0_io_data_1_read}]
set_input_delay -clock io_systemClk -min 3.084 [get_ports {system_spi_0_io_data_1_read}]
set_output_delay -clock io_systemClk -max -4.700 [get_ports {system_spi_0_io_data_1_write}]
set_output_delay -clock io_systemClk -min -2.571 [get_ports {system_spi_0_io_data_1_write}]
set_output_delay -clock io_systemClk -max -4.707 [get_ports {system_spi_0_io_data_1_writeEnable}]
set_output_delay -clock io_systemClk -min -2.567 [get_ports {system_spi_0_io_data_1_writeEnable}]

# LVDS TX GPIO Constraints
############################
set_input_delay -clock io_systemClk -max 6.100 [get_ports {system_spi_1_io_data_1}]
set_input_delay -clock io_systemClk -min 3.050 [get_ports {system_spi_1_io_data_1}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {probes[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {probes[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {probes[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {probes[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {probes[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {probes[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {probes[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {probes[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {probes[4]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {probes[4]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {probes[5]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {probes[5]}]
set_output_delay -clock io_systemClk -max -5.210 [get_ports {system_spi_1_io_data_0}]
set_output_delay -clock io_systemClk -min -2.480 [get_ports {system_spi_1_io_data_0}]
set_output_delay -clock io_systemClk -max -5.210 [get_ports {system_spi_1_io_sclk}]
set_output_delay -clock io_systemClk -min -2.480 [get_ports {system_spi_1_io_sclk}]
set_output_delay -clock io_systemClk -max -5.210 [get_ports {system_spi_1_io_ss}]
set_output_delay -clock io_systemClk -min -2.480 [get_ports {system_spi_1_io_ss}]

# LVDS Rx Constraints
####################

# LVDS TX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {io_asyncReset}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {io_asyncReset}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_de}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_de}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_hsync}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_hsync}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[0]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[0]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[1]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[1]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[2]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[2]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[3]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[3]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[4]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[4]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[5]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[5]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[6]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[6]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[7]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[7]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[8]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[8]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[9]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[9]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[10]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[10]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[11]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[11]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[12]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[12]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[13]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[13]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[14]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[14]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_txd[15]}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_txd[15]}]
set_output_delay -clock video_clk_148 -max -5.210 [get_ports {hdmi_vsync}]
set_output_delay -clock video_clk_148 -min -2.480 [get_ports {hdmi_vsync}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {probes[6]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {probes[6]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {probes[7]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {probes[7]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_gpio_0_io_read[0]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_gpio_0_io_read[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_gpio_0_io_write[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_gpio_0_io_write[0]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_gpio_0_io_writeEnable[0]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_gpio_0_io_writeEnable[0]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_gpio_0_io_read[1]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_gpio_0_io_read[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_gpio_0_io_write[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_gpio_0_io_write[1]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_gpio_0_io_writeEnable[1]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_gpio_0_io_writeEnable[1]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_gpio_0_io_read[2]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_gpio_0_io_read[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_gpio_0_io_write[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_gpio_0_io_write[2]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_gpio_0_io_writeEnable[2]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_gpio_0_io_writeEnable[2]}]
# set_input_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_gpio_0_io_read[3]}]
# set_input_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_gpio_0_io_read[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_gpio_0_io_write[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_gpio_0_io_write[3]}]
# set_output_delay -clock <CLOCK> -max <MAX CALCULATION> [get_ports {system_gpio_0_io_writeEnable[3]}]
# set_output_delay -clock <CLOCK> -min <MIN CALCULATION> [get_ports {system_gpio_0_io_writeEnable[3]}]

# LVDS Tx Constraints
####################

# JTAG Constraints
####################
# create_clock -period <USER_PERIOD> [get_ports {bscan_TCK}]
# create_clock -period <USER_PERIOD> [get_ports {bscan_DRCK}]
set_output_delay -clock bscan_TCK -max 0.111 [get_ports {bscan_TDO}]
set_output_delay -clock bscan_TCK -min 0.053 [get_ports {bscan_TDO}]
set_input_delay -clock_fall -clock bscan_TCK -max 0.267 [get_ports {bscan_CAPTURE}]
set_input_delay -clock_fall -clock bscan_TCK -min 0.134 [get_ports {bscan_CAPTURE}]
set_input_delay -clock_fall -clock bscan_TCK -max 0.267 [get_ports {bscan_RESET}]
set_input_delay -clock_fall -clock bscan_TCK -min 0.134 [get_ports {bscan_RESET}]
set_input_delay -clock_fall -clock bscan_TCK -max 0.267 [get_ports {bscan_RUNTEST}]
set_input_delay -clock_fall -clock bscan_TCK -min 0.134 [get_ports {bscan_RUNTEST}]
set_input_delay -clock_fall -clock bscan_TCK -max 0.231 [get_ports {bscan_SEL}]
set_input_delay -clock_fall -clock bscan_TCK -min 0.116 [get_ports {bscan_SEL}]
set_input_delay -clock_fall -clock bscan_TCK -max 0.267 [get_ports {bscan_UPDATE}]
set_input_delay -clock_fall -clock bscan_TCK -min 0.134 [get_ports {bscan_UPDATE}]
set_input_delay -clock_fall -clock bscan_TCK -max 0.321 [get_ports {bscan_SHIFT}]
set_input_delay -clock_fall -clock bscan_TCK -min 0.161 [get_ports {bscan_SHIFT}]
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_TCK}]
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_DRCK}]
set_output_delay -clock jtag_inst1_TCK -max 0.111 [get_ports {jtag_inst1_TDO}]
set_output_delay -clock jtag_inst1_TCK -min 0.053 [get_ports {jtag_inst1_TDO}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_RUNTEST}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_RUNTEST}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.231 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.116 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.321 [get_ports {jtag_inst1_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.161 [get_ports {jtag_inst1_SHIFT}]

# DDR Constraints
#####################
set_output_delay -clock ddr_inst1_CFG_SCL_IN -max 3.000 [get_ports {ddr_inst1_CFG_SDA_IN}]
set_output_delay -clock ddr_inst1_CFG_SCL_IN -min 0.500 [get_ports {ddr_inst1_CFG_SDA_IN}]
set_input_delay -clock ddr_inst1_CFG_SCL_IN -max 3.000 [get_ports {ddr_inst1_CFG_SDA_OEN}]
set_input_delay -clock ddr_inst1_CFG_SCL_IN -min 1.500 [get_ports {ddr_inst1_CFG_SDA_OEN}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_arwaddr[*]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_arwaddr[*]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_arwburst[1] dma_arwburst[0]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_arwburst[1] dma_arwburst[0]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_arwid[*]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_arwid[*]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_arwlen[*]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_arwlen[*]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_arwlock[1] dma_arwlock[0]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_arwlock[1] dma_arwlock[0]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_arwsize[2] dma_arwsize[1] dma_arwsize[0]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_arwsize[2] dma_arwsize[1] dma_arwsize[0]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_arwwrite}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_arwwrite}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_arwvalid}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_arwvalid}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_bready}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_bready}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_rready}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_rready}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_wdata[*]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_wdata[*]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_wid[*]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_wid[*]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_wlast}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_wlast}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_wstrb[*]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_wstrb[*]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {dma_wvalid}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {dma_wvalid}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {dma_arwready}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {dma_arwready}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {dma_bid[*]}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {dma_bid[*]}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {dma_bvalid}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {dma_bvalid}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {dma_rdata[*]}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {dma_rdata[*]}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {dma_rid[*]}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {dma_rid[*]}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {dma_rlast}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {dma_rlast}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {dma_rresp[1] dma_rresp[0]}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {dma_rresp[1] dma_rresp[0]}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {dma_rvalid}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {dma_rvalid}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {dma_wready}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {dma_wready}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_arw_payload_addr[*]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_arw_payload_addr[*]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_arw_payload_burst[1] io_ddrA_arw_payload_burst[0]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_arw_payload_burst[1] io_ddrA_arw_payload_burst[0]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_arw_payload_id[*]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_arw_payload_id[*]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_arw_payload_len[*]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_arw_payload_len[*]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_arw_payload_lock[1] io_ddrA_arw_payload_lock[0]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_arw_payload_lock[1] io_ddrA_arw_payload_lock[0]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_arw_payload_size[2] io_ddrA_arw_payload_size[1] io_ddrA_arw_payload_size[0]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_arw_payload_size[2] io_ddrA_arw_payload_size[1] io_ddrA_arw_payload_size[0]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_arw_payload_write}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_arw_payload_write}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_arw_valid}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_arw_valid}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_b_ready}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_b_ready}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_r_ready}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_r_ready}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_w_payload_data[*]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_w_payload_data[*]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_w_payload_id[*]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_w_payload_id[*]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_w_payload_last}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_w_payload_last}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_w_payload_strb[*]}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_w_payload_strb[*]}]
set_output_delay -clock io_memoryClk -max -2.810 [get_ports {io_ddrA_w_valid}]
set_output_delay -clock io_memoryClk -min -2.155 [get_ports {io_ddrA_w_valid}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {io_ddrA_arw_ready}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {io_ddrA_arw_ready}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {io_ddrA_b_payload_id[*]}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {io_ddrA_b_payload_id[*]}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {io_ddrA_b_valid}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {io_ddrA_b_valid}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {io_ddrA_r_payload_data[*]}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {io_ddrA_r_payload_data[*]}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {io_ddrA_r_payload_id[*]}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {io_ddrA_r_payload_id[*]}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {io_ddrA_r_payload_last}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {io_ddrA_r_payload_last}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {io_ddrA_r_payload_resp[1] io_ddrA_r_payload_resp[0]}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {io_ddrA_r_payload_resp[1] io_ddrA_r_payload_resp[0]}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {io_ddrA_r_valid}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {io_ddrA_r_valid}]
set_input_delay -clock io_memoryClk -max 8.310 [get_ports {io_ddrA_w_ready}]
set_input_delay -clock io_memoryClk -min 4.155 [get_ports {io_ddrA_w_ready}]